Autodesk.Navisworks.Api.ProgressSubOperationEndedEventArgs
Event arguments used for the Application::ProgressSubOperationEnded event

Autodesk.Navisworks.Api.ProgressSubOperationEndedEventArgs.Completed
Gets a value indicating whether the sub-operation was fully completed

Autodesk.Navisworks.Api.ProgressSubOperationEndedEventArgs.Progress
Gets a reference to the Progress class instance relating to this Event.